**package dependencies**
- pandas=1.4.3
- sklearn=1.1.1
- matplotlib=3.5.2
- jupyterlab=3.4.3
- python=3.9.13

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('Mall_Customers.csv')
df.head(2)

   CustomerID Gender  Age  Annual Income (k$)  Spending Score (1-100)
0           1   Male   19                  15                      39
1           2   Male   21                  15                      81

In [4]:
df.rename(columns={'Spending Score (1-100)':'Spending','Annual Income (k$)':'Annual Income'},inplace=True)

In [5]:
df.head(2)

   CustomerID Gender  Age  Annual Income  Spending
0           1   Male   19             15        39
1           2   Male   21             15        81

In [6]:
rel_cols = ['Age','Annual Income','Spending']
df_rel = df[rel_cols]

In [7]:
df_rel.head(2)

   Age  Annual Income  Spending
0   19             15        39
1   21             15        81

### Standardize the numeric values

In [9]:
from sklearn.preprocessing import StandardScaler
X = df_rel.values

In [10]:
scaler = StandardScaler()
x_scaled = scaler.fit_transform(X)

### Make a cluster model (N clusters = 4)

In [12]:
from sklearn.cluster import KMeans
mod1 = KMeans(n_clusters=4)
mod1 = mod1.fit(x_scaled)

In [13]:
mod1.labels_ ### cluster labels

array([0, 0, 0, 0, 0, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 0, 0, 1, 0, 0, 0,
       1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0, 1, 0,
       1, 0, 1, 0, 0, 0, 1, 0, 0, 1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 1, 0,
       1, 1, 0, 0, 1, 1, 1, 1, 1, 0, 1, 1, 0, 1, 1, 0, 1, 1, 0, 1, 1, 0,
       0, 1, 1, 0, 1, 1, 0, 0, 1, 0, 1, 0, 0, 1, 1, 0, 1, 0, 1, 1, 1, 1,
       1, 0, 3, 0, 0, 0, 1, 1, 1, 1, 0, 3, 2, 2, 3, 2, 3, 2, 1, 2, 3, 2,
       3, 2, 3, 2, 3, 2, 3, 2, 3, 2, 3, 2, 3, 2, 3, 2, 3, 2, 3, 2, 3, 2,
       3, 2, 3, 2, 3, 2, 1, 2, 3, 2, 3, 2, 3, 2, 3, 2, 3, 2, 3, 2, 3, 2,
       3, 2, 3, 2, 3, 2, 3, 2, 3, 2, 3, 2, 3, 2, 3, 2, 3, 2, 3, 2, 3, 2,
       3, 2], dtype=int32)

In [14]:
df['cluster_4'] = mod1.labels_

In [15]:
df.head()

   CustomerID  Gender  Age  Annual Income  Spending  cluster_4
0           1    Male   19             15        39          0
1           2    Male   21             15        81          0
2           3  Female   20             16         6          0
3           4  Female   23             16        77          0
4           5  Female   31             17        40          0

### Class Exercise

- Read the data `customers.csv`
- Do the necessary data transformations
- Create a cluster model with 5 clusters
- How many married people are in each cluster you end up creating

In [16]:
customers = pd.read_csv('customers.csv')
customers.head(2)

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1
0,458989,Female,Yes,36,Yes,Engineer,0.0,Low,1.0,Cat_6
1,458994,Male,Yes,37,Yes,Healthcare,8.0,Average,4.0,Cat_6

In [26]:
customers.isnull().sum()

ID                   0
Gender               0
Ever_Married        50
Age                  0
Graduated           24
Profession          38
Work_Experience    269
Spending_Score       0
Family_Size        113
Var_1               32
dtype: int64

In [27]:
customers = customers.dropna()

In [28]:
rel_cols = ['Age','Work_Experience','Family_Size']
X = customers[rel_cols].dropna().values

In [29]:
scaler = StandardScaler()
x_scaled = scaler.fit_transform(X)

In [30]:
mod2 = KMeans(n_clusters=5)
mod2 = mod2.fit(x_scaled)

In [31]:
customers['cluster_5'] = mod2.labels_

/var/folders/7h/01sjg2sx6tl3y72r2klm24c80000gn/T/ipykernel_50118/1776474142.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  customers['cluster_5'] = mod2.labels_

In [32]:
customers.head(2)

,ID,Gender,Ever_Married,Age,Graduated,Profession,Work_Experience,Spending_Score,Family_Size,Var_1,cluster_5
0,458989,Female,Yes,36,Yes,Engineer,0.0,Low,1.0,Cat_6,4
1,458994,Male,Yes,37,Yes,Healthcare,8.0,Average,4.0,Cat_6,2

In [34]:
customers.groupby(['Gender','cluster_5']).agg({'Gender':'size'})

                  Gender
Gender cluster_5
Female 0             140
       1             169
       2             227
       3             128
       4             306
Male   0             206
       1             206
       2             203
       3             218
       4             351